Repository: abdurrohmanq/Nur
Catalog: Nur.Bot/Resources/BotLocalizer.*.resx
Languages: ru, uz

# btnBack
source: ⬅️ Back
ru: ⬅️ Назад
uz: ⬅️ Ortga

# btnBasket
source: 🛒 Basket
ru: 🛒 корзинка
uz: 🛒 Savat

# btnCancel
source: Cancel 🔴
ru: Отмена 🔴
uz: Bekor qilish 🔴

# btnClearCart
source: 🧹 Cleaning
ru: 🧹 Уборка

# btnConfirmation
source: ✅ Confirmation
ru: ✅ Подтверждение

# btnDelivery
source: 🚖 Delivery
ru: 🚖 Доставка
uz: 🚖 Yetkazib berish

# btnEditLanguage
source: 🇬🇧 Select language!
ru: 🇷🇺 Выберите язык!
uz: 🇺🇿 Tilni tanlang!

# btnEditPersonalInfo
source: 🔄 Change personal information
ru: 🔄 Изменение личных данных
uz: 🔄 Shaxsiy ma'lumotlarni o'zgartirish

# btnFeedback
source: ✍️ Comment
ru: ✍️ Комментарий
uz: ✍️ Fikr bildirish

# btnFullName
source: Edit Full Name
ru: Смена имени
uz: Ism sharifni o'zgartirish

# btnInfo
source: ℹ️ Information
ru: ℹ️ Информация
uz: ℹ️ Ma'lumot

# btnMainMenu
source: 🏠 Main menu
ru: 🏠 Главное меню
uz: 🏠 Asosiy menu

# btnOrder
source: 🛍 Place an order
ru: 🛍 Заказать
uz: 🛍 Buyurtma berish

# btnPaymentTypeCash
source: 💵 cash
ru: 💵 Наличные

# btnPhone
source: 📞 Contact us
ru: 📞 Связаться с нами
uz: 📞 Biz bilan aloqa

# btnPhoneNumber
source: Edit phone number
ru: Изменение номера
uz: Raqamni o'zgartirish

# btnPlaceOrder
source: 🚖 Placing an order
ru: 🚖 Заказать
uz: 🚖 Buyurtma berish

# btnRequestContact
source: Send phone number
ru: Отправить номер телефона
uz: 📞 Telefon raqamni jo'natish

# btnSetting
source: ⚙️ Settings
ru: ⚙️ Настройки
uz: ⚙️ Sozlamalar

# btnTakeAway
source: 🏃 Take away
ru: 🏃 Забрать
uz: 🏃 Olib ketish

# choose-language
source: Select Language
ru: Выберите язык!
uz: Tilni tanlang!

# GetContact
source: Your number has been accepted!
ru: Ваш номер принят!
uz: Sizning raqamingiz qabul qilindi!

# greeting
source: Hello! Welcome to Nur canteen
ru: Добро пожаловать в Нур Кухню!
uz: Assalomu Alaykum! Nur oshxonasiga xush kelibsiz!

# OpenToMenu
source: Start ordering! 😊
ru: Начать заказывать! 😊
uz: Buyurtma berishni boshlang! 😊

# RequestForFullName
source: Enter your full name:
ru: Введите свое имя и фамилию:
uz: Ism familiyangizni kiriting:

# RequestToContact
source: Enter your phone number or submit by clicking the button below!
ru: Введите свой номер телефона или отправьте его, нажав кнопку ниже!
uz: Telefon raqamingizni kiriting yoki quyidagi tugmani bosish orqali yuboring!

# select-menu
source: Make your choice!
ru: Отметьте свой выбор!
uz: Tanlovingizni belgilang!

# txtAddedProductInCart
source: {0} {1} added to cart!
ru: {0} {1} добавлены в корзину!

# txtAnew
source: Shall we start over?
ru: Начнем заново?

# txtBad
source: Bad 🚫
ru: Плохо 🚫
uz: Yomon 🚫

# txtCartEmpty
source: Cart is empty
ru: В корзине ничего нет

# txtCartEmptyInfo
source: Your cart is empty. Choose a product to order!
ru: Ваша корзина пуста. Выберите товар для заказа!

# txtCartReleased
source: Cart was empty!
ru: Корзинка опустошена!

# txtCleanCartInfo
source: "❌ <Product name> - remove from cart\n" + "🧹 Cleaning" - completely empty the basket",
ru: ❌ <Название товара> - удалить из корзины 🧹 Уборка" - полностью опорожнить корзину,

# txtComments
source: Comments:
ru: Примечания:

# txtContactInfo
source: You can call <<+998905710460>> to contact us!
ru: Вы можете позвонить <{0}>, чтобы связаться с нами!
uz: Biz bilan aloqaga chiqish uchun <<+998905710460>> ga qo'ng'iroq qilishingiz mumkin!

# txtContinueOrder
source: Do we continue to order? 😋
ru: Продолжаем заказывать? 😋

# txtCurrentFullName
source: Your current full name: {0}
ru: Ваше текущее имя: {0}
uz: Hozirgi ism sharifingiz: {0}

# txtDislike
source: Dislike 👎🏻
ru: Не понравилось 👎🏻
uz: Yoqmadi 👎🏻

# txtEmptyCategory
source: There are currently no products in this category.
ru: Пока в этой категории нет продуктов.
uz: Hozircha bu categoryda mahsulot yo'q.

# txtErrorDeleteCart
source: Cart not cleared! Please try again if there is a problem!
ru: Корзина не убиралась! Попробуйте еще раз, чтобы решить проблему!

# txtFeedback
source: Thank you for choosing us!\n Leave a comment or rate our service!
ru: Спасибо, что выбрали нас! \nОставьте отзыв или оцените наш сервис!
uz: Bizni tanlagingiz uchun tashakkur!\nFikr bildiring yoki xizmatimizni baholang!

# txtGood
source: Good ✨
ru: Хорошо ✨
uz: Yaxshi ✨

# txtInfo
source: Nur Cafe is a national and dietary food center. [Instagram](https://www.instagram.com/nur_kafe_andijon/) [Facebook](https://www.facebook.com/nur.parxez/?show_switched_toast=0&show_invite_to_follow=0&show_switched_tooltip=0&show_podcast_settings=0&show_community_review_changes=0&show_community_rollback=0&show_follower_visibility_disclosure=0) Our address is 👇
ru: NUR Cafe-это центр национального и диетического питания. [Instagram]({0}) [Facebook]({1}) Наш адрес 👇
uz: Bu Nur oshxonasi Telegram boti!

# txtInputProductQuantity
source: Enter the quantity of the selected product or select one of the buttons below!
ru: Введите выбранное количество продукта или выберите одну из кнопок ниже!

# txtMenuPersonalInfo
source: Choose to change your personal information
ru: Чтобы изменить личные данные, выберите
uz: Shaxsiy ma'lumotlarni o'zgartirish uchun tanlang

# txtNewFullName
source: Enter your new Full Name:
ru: Введите свое новое имя:
uz: Yangi ism sharifingizni kiriting:

# txtNoComment
source: No further comment
ru: Никаких дополнительных комментариев

# txtNotEnoughProduct
source: We do not have the product in the quantity you entered!
ru: Нет такого количества продукта!

# txtNotFoundProduct
source: There is no such product!
ru: Такого продукта нет!

# txtNotReceiveLocation
source: No address information found. Send it again!
ru: Адресная информация не найдена. Отправить снова!
uz: Manzil ma'lumotlari topilmadi. Qaytadan yuboring!

# txtOccureErrorInputQuantity
source: Could not add product to cart! Please try again!
ru: Невозможно добавить товар в корзину! Попробуйте еще раз!

# txtOnRoad
source: Order on the way... Arrives in minutes!
ru: Заказ уже в пути... Достигается за считанные минуты!

# txtOrderCancel
source: Order cancelled.
ru: Приказ был отменен.

# txtOrderType
source: Order type:
ru: Тип заказа:

# txtPaymentType
source: 💴 Payment type:
ru: 💴 Тип оплаты:

# txtPendingOrder
source: The order has been placed on pending. Please wait a moment.
ru: Заказ был переведен в режим ожидания. Пожалуйста, подождите немного.

# txtPhone
source: ☎️ Phone:
ru: ☎️ Телефон

# txtPhoneError
source: The number was entered incorrectly! Example: "+998901234567"
ru: Номер введен с ошибкой! Пример: "+998901234567"
uz: Raqam xato kiritildi! Na'muna: "+998901234567"

# txtPrepared
source: The order is ready! Will be delivered soon.
ru: Заказ готов! Скоро будет доставлено.

# txtPreparing
source: Order is being prepared. Will be delivered soon.
ru: Заказ готовится. Скоро будет доставлено.

# txtProductPrice
source: 💰 *Price:* {0}
ru: 💰 *Цена:* {0}

# txtReceiveLocation
source: Your address has been accepted!
ru: Ваш адрес принят!
uz: Manzilingiz qabul qilindi!

# txtRemovedCartItem
source: {0} removed from cart!
ru: {0} удалено из корзины!

# txtRequestForLocation
source: Where should your order be delivered 🚙?
ru: 🚙 Куда доставить заказ?
uz: Buyurtmangizni qayerga yetkazib berish kerak 🚙?

# txtRequestToOrderType
source: Pick up your order yourself or choose 'Delivery'
ru: Заберите заказ самостоятельно или выберите "доставка"
uz: Buyurtmani o'zingiz olib keting yoki 'Yetkazib berish' ni tanlang!

# txtSelectCategory
source: Choose a product category!
ru: Выберите категорию продукта!
uz: Mahsulot categoriyasini tanlang!

# txtSelectedLanguage
source: Well, we will continue with you in English!
ru: Очень хорошо, мы продолжим с вами на русском языке!
uz: Yaxshi siz bilan o'zbek tilida davom etamiz!

# txtSelectPaymentType
source: Choose a payment method for your order!
ru: Выберите тип оплаты для вашего заказа!

# txtSelectProduct
source: Select product!
ru: Выберите товар!
uz: Mahsulot tanlang!

# txtSendLocation
source: 📍 Send current address
ru: 📍 Отправить текущий адрес
uz: 📍 Joriy manzilni yuborish

# txtSettings
source: ⚙️ Settings
ru: ⚙️ Настройки
uz: ⚙️ Sozlamalar

# txtTakeAwayLocation
source: Nur cafe location 👇
ru: Кафе "Нур адрес" 👇

# txtTextLocation
source: Address in text view is not possible!
ru: Адрес нельзя вводить в текстовом виде!
uz: Manzilni matn ko'rinishida kiritish mumkin emas!

# txtThankFeedback
source: Thank you! Thanks for your thoughts and feedback!
ru: Спасибо! Спасибо за ваши комментарии и отзывы!
uz: Rahmat! Fikr va mulohazangiz uchun tashakkur!

# txtTotalPrice
source: Total: {0} soums
ru: Итого: {0} Сум

# txtVeryGood
source: I liked everything 👍
ru: Все понравилось 👍
uz: Hammasi yoqdi 👍

# txtWriteCommentForOrder
source: If you have any additional comments, please leave a comment:
ru: Если у вас есть дополнительные комментари, запишите их:

# txtWrongInputProduct
source: Delete with just a click of a button!
ru: Просто выключите его, нажав кнопку!

# txtWrongQuantity
source: Invalid amount entered. Please enter a valid number!
ru: Введена неправильная сумма. Пожалуйста, введите действительное число.

# txtYourOrder
source: Your order:
ru: Ваш заказ:
